In [37]:
import csv
from DATA225utils import make_connection
import pandas as pd

In [30]:
conn = make_connection(config_file = 'movies.ini')
cursor = conn.cursor()

In [31]:
cursor.execute('DROP TABLE IF EXISTS movies')

sql = ( """
        CREATE TABLE movies
        (
            movieIds  int,
            userIds   int,
            ratings   double,
            timestamp int, 
            PRIMARY KEY(timestamp)
        )
        """
      )

cursor.execute(sql);

In [32]:
sql_all = (   """
              INSERT INTO movies
              VALUES (%s, %s, %s, %s)
              """
          )

In [27]:
cursor.close()
conn.close()

In [33]:
counter = 0
first = True
i = 0

with open('/Users/josephchang/Desktop/archive/ratings.csv', newline='') as csv_file:
    data = csv.reader(csv_file, delimiter=',', quotechar='"')
    
    for row in data:
        if not first:
            #transform(row)
            cursor.execute(sql_all, row)
            counter = counter + 1
        
        if counter == 10:
            break
            
            
        first = False
    
conn.commit()

In [35]:
sql =   (""" SELECT * FROM movies""")

cursor.execute(sql)
test = cursor.fetchall()
print(test);

[(1, 2762, 4.5, 1425941300), (1, 858, 5.0, 1425941523), (1, 110, 1.0, 1425941529), (1, 1221, 5.0, 1425941546), (1, 1246, 5.0, 1425941556), (1, 2918, 5.0, 1425941593), (1, 2959, 4.0, 1425941601), (1, 1968, 4.0, 1425942148), (1, 4226, 4.0, 1425942228), (1, 147, 4.5, 1425942435)]

In [38]:
pd.DataFrame(test)

   0     1    2           3
0  1  2762  4.5  1425941300
1  1   858  5.0  1425941523
2  1   110  1.0  1425941529
3  1  1221  5.0  1425941546
4  1  1246  5.0  1425941556
5  1  2918  5.0  1425941593
6  1  2959  4.0  1425941601
7  1  1968  4.0  1425942148
8  1  4226  4.0  1425942228
9  1   147  4.5  1425942435